In [2]:
import numpy as np
import seaborn as sns
import scipy.stats as stats
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data

### Answer with the type of test you would use (assume normal distribution):

- Is there a difference in grades of students on the second floor compared to grades of all students?

In [ ]:
# One sample t-test
# two-tailed (non directional)

- Are adults who drink milk taller than adults who dont drink milk?

In [ ]:
# Independent t-test (or 2-sample)
# one-tailed (directional)

- Is the the price of gas higher in texas or in new mexico?

In [ ]:
# Independent t-test (or 2-sample)
# one-tailed (directional)

- Are there differences in stress levels between students who take data science vs students who take web development vs students who take cloud academy?

In [ ]:
# ANOVA
# two-tailed (non directional)

### Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

H$_O$ : Mean of time it takes to sell homes at office 1 = Mean of time it takes to sell homes at office 2

H$_a$ : Mean of time it takes to sell homes at office 1 != Mean of time it takes to sell homes at office 2

In [74]:
α = 0.05

In [3]:
μ_one = 90
σ_one = 15

μ_two = 100
σ_two = 20

In [52]:
office_one_sales = np.random.normal(μ_one, σ_one, size = 40)

In [53]:
office_two_sales = np.random.normal(μ_two, σ_two, size = 50)

In [63]:
stat, p_levene = stats.levene(office_one_sales, office_two_sales)

In [64]:
p_levene < α

False

In [57]:
t_stat, p_val = stats.ttest_ind_from_stats(
    μ_one,
    σ_one,
    40,
    μ_two,
    σ_two,
    50)

In [58]:
t_stat

-2.6252287036468456

In [59]:
p_val

0.01020985244923939

In [60]:
p_val < α

True

 I can reject my null hypothesis because p_val is less than alpha.

### Load the mpg dataset and use it to answer the following questions:

In [18]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

- Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

In [19]:
#create a new column displaying avg fuel efficiency
mpg['avg_eff'] = (mpg.cty + mpg.hwy) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_eff
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [ ]:
#My two groups of comparision: 
# - fuel efficiency of 1999 cars
# - fuel efficiency of 2008 cars

In [22]:
#Determine samples

older_cars_eff = mpg[mpg.year == 1999].avg_eff

newer_cars_eff = mpg[mpg.year == 2008].avg_eff

H$_0$: 1999 cars efficiency = to the efficiency of 2008 cars

H$_a$: 1999 cars have a difference in efficiency than 2008 cars

In [65]:
stat, p_val = stats.levene(older_cars_eff, newer_cars_eff)

In [66]:
p_val < α

False

In [24]:
t_stat, p_val = stats.ttest_ind(older_cars_eff, newer_cars_eff, equal_var=False)
t_stat, p_val

(0.21960177245940962, 0.8263750772060638)

In [68]:
print("is p_val < alpha? ", p_val < α)

is p_val < alpha?  False

I cannot reject my null hypothesis.

- Are compact cars more fuel-efficient than the average car?

In [ ]:
#My two groups of comparision: 
# - fuel efficiency compact cars
# - fuel efficiency of the avg car

In [35]:
#Determine samples

comp_cars_eff = mpg[mpg['class'] == 'compact'].avg_eff

μth = mpg.avg_eff.mean()

H$_0$: compact cars are as efficient as the avg car

H$_a$: compact cars are more efficient than the avg car

In [70]:
t_stat, p_val = stats.ttest_1samp(comp_cars_eff, μth)

In [71]:
t_stat

7.896888573132533

In [76]:
p_val

4.1985637943171486e-10

In [82]:
p_val / 2

2.0992818971585743e-10

For a 1-tailed test where our alternative hypothesis is testing for "greater than", we evaluate 𝑝/2 < 𝛼 and 𝑡 > 0.
Therefore we can reject the hypothesis becuase p_val/2 is > the alpha of .05,  and t_stat > 0

- Do manual cars get better gas mileage than automatic cars?

In [ ]:
# groups for testing:
# - manual trans cars
# - auto trans cars

#two sample because there are two explicit subcategories of vehicles
#one tailed because we are aplying directionality to our diffence: >

H$_0$: manual car efficiency <= auto car efficiency

H$_a$: manual car efficiency > auto car efficiency

In [44]:
# create new column with boolean values for auto or manual transmission
mpg['auto_trans'] = mpg.trans.str.startswith('auto')

In [46]:
#determine samples
auto_eff = mpg[mpg['auto_trans'] == True].avg_eff

manual_eff = mpg[mpg['auto_trans'] == False].avg_eff

In [47]:
#check varience
print(auto_eff.var())
print(manual_eff.var())

21.942777233382337
26.635167464114826

In [83]:
t_stat, p_val = stats.ttest_ind(manual_eff, auto_eff, equal_var=False)
t_stat, p_val

(4.443514012903072, 1.7952248999917893e-05)

In [85]:
print("is p_val/2 < alpha? ", (1.795 / 2) < α)
print("is t_stat > 0? ", t_stat > 0)

is p_val/2 < alpha?  False
is t_stat > 0?  True

For a 1-tailed test where our alternative hypothesis is testing for "greater than", we evaluate 𝑝/2 < 𝛼 and 𝑡 > 0. Therefore we can reject the Null hypothesis becuase p_val/2 is not < the alpha of .05, and t_stat > 0

## Exercises

### Continue working in your hypothesis_testing notebook.

### Answer with the type of stats test you would use (assume normal distribution):

Is there a relationship between the length of your arm and the length of your foot?

    - continuous x continuous: linear correlation between two continuous values, does one affect the other. (pearson's correlation)

Do guys and gals quit their jobs at the same rate?

    - categorical x categorical: chi^2

Does the length of time of the lecture correlate with a students grade?

    - continuous x continuous: linear correlation between two continuous values, does one affect the other. (pearson's correlation)

### Use the telco_churn data.

In [24]:
import env

In [25]:
url = env.get_db_url('telco_churn')

In [142]:
telco_churn = pd.read_sql('select * from customers', url)

In [207]:
telco_churn.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.6,593.3,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.9,542.4,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.9,267.4,Yes

Does tenure correlate with monthly charges?

H$_0$ : There is no linear relationship between tenure and monthly charges
    
H$_a$ : There is a linear relationship between tenure and monthly charges

In [30]:
tenure = telco_churn.tenure
monthly_charges = telco_churn.monthly_charges

In [32]:
# confidence level = 0.95
# alpha = 0.05

α = 0.05

In [34]:
r, p = stats.pearsonr(tenure, monthly_charges)

In [35]:
if p < α:
    print('We can reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We can reject the null hypothesis

In [36]:
r

0.24789985628615246

In [37]:
p

4.094044991483017e-99

Total charges?

In [73]:
telco_churn['total_charges'] = telco_churn['total_charges'].dropna().str.replace(' ', '')

In [74]:
telco_churn['total_charges'].dtype

dtype('O')

In [75]:
telco_churn['total_charges'] = pd.to_numeric(telco_churn['total_charges'])

In [76]:
telco_churn['total_charges'].dtype

dtype('float64')

In [86]:
telco_churn['total_charges'] = np.nan_to_num(telco_churn['total_charges'])

In [87]:
tenure = telco_churn['tenure']
total_charges = telco_churn['total_charges']

In [88]:
r, p = stats.pearsonr(tenure, total_charges)

In [89]:
if p < α:
    print('We can reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We can reject the null hypothesis

In [90]:
r

0.8261783979502481

In [91]:
p

0.0

What happens if you control for phone and internet service? #########

In [147]:
has_phone = telco_churn['phone_service']
has_phone

0       Yes
1       Yes
2       Yes
3       Yes
4       Yes
       ...
7038    Yes
7039    Yes
7040    Yes
7041    Yes
7042     No
Name: phone_service, Length: 7043, dtype: object

In [148]:
int_type = telco_churn['internet_service_type_id']

In [149]:
observed = pd.crosstab(has_phone, int_type)
observed

internet_service_type_id     1     2     3
phone_service
No                         682     0     0
Yes                       1739  3096  1526

H$_0$ : There is no relationship/dependancy between internet type and phone service
    
H$_a$ : There is a relationship/dependancy between internet type and phone service

In [150]:
α

0.05

In [151]:
stats.chi2_contingency(observed)

(1441.6233871976851,
 0.0,
 2,
 array([[ 234.43447395,  299.79724549,  147.76828056],
        [2186.56552605, 2796.20275451, 1378.23171944]]))

In [152]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [153]:
if p < α:
    print('We can reject the null hypothesis')
    print(f'Our p value is {p} and our chi-squared statistic is {chi2}')
else:
    print('We fail to reject the null hypothesis')

We can reject the null hypothesis
Our p value is 0.0 and our chi-squared statistic is 1441.6233871976851

### Use the employees database.

Is there a relationship between how long an employee has been with the company and their salary?

In [159]:
import env

In [160]:
url = env.get_db_url('employees')

In [185]:
emp_title = pd.read_sql('select * from titles', url)

In [189]:
emp_title.size

1773232

Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [197]:
emp_title['title_counts'] = pd.read_sql('''
                                        select count(title) 
                                        from titles
                                        group by emp_no
                                        ;''', url)

In [192]:
to_date_str = emp_title.to_date.astype(str)
to_date_str.str.replace('9999-01-01', '2023-03-07')


emp_title['to_date'] = emp_title['to_date'].astype(str).str.replace('9999-01-01', '2023-03-07')

In [202]:
emp_title['years'] = emp_title['to_date'].astype(str).str[:4].astype(int) - emp_title['from_date'].astype(str).str[:4].astype(int)

In [203]:
emp_title.head(10)

   emp_no            title   from_date     to_date  title_counts  years
0   10001  Senior Engineer  1986-06-26  2023-03-07           1.0     37
1   10002            Staff  1996-08-03  2023-03-07           1.0     27
2   10003  Senior Engineer  1995-12-03  2023-03-07           1.0     28
3   10004         Engineer  1986-12-01  1995-12-01           2.0      9
4   10004  Senior Engineer  1995-12-01  2023-03-07           2.0     28
5   10005     Senior Staff  1996-09-12  2023-03-07           1.0     27
6   10005            Staff  1989-09-12  1996-09-12           2.0      7
7   10006  Senior Engineer  1990-08-05  2023-03-07           1.0     33
8   10007     Senior Staff  1996-02-11  2023-03-07           3.0     27
9   10007            Staff  1989-02-10  1996-02-11           1.0      7

In [206]:
emp_title.groupby('emp_no').sum('years')

        title_counts  years
emp_no
10001            1.0     37
10002            1.0     27
10003            1.0     28
10004            4.0     37
10005            3.0     34
...              ...    ...
499995           0.0     26
499996           0.0     27
499997           0.0     36
499998           0.0     30
499999           0.0     26

[300024 rows x 2 columns]

### Use the sleepstudy data.

Is there a relationship between days and reaction time?

In [14]:
sleep = data('sleepstudy')

In [15]:
sleep.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

H$_0$ : There is no linear relationship between days and reaction time
    
H$_a$ : There is a linear relationship between days and reaction time

In [16]:
days = sleep.Days
reaction = sleep.Reaction

In [17]:
α = 0.05

In [18]:
r, p = stats.pearsonr(days, reaction)

In [19]:
r

0.5352302262650255

In [20]:
p

9.89409632221439e-15

In [21]:
if p < α:
    print('We can reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We can reject the null hypothesis